---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpacingLengthHoriz
source: html/38b0b27a-71eb-4cda-c596-817fba07b586.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpacingLengthHoriz Property

"Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId SpacingLengthHoriz { get; }
```